# 다음 사건사고가 발생하기까지 걸리는 시간

### Data
이 문제에서는 Austine시에서 발생한 사건⠂사고와 관련된 데이터가 주어집니다. 주어지는 column 은 다음과 같습니다.

* unique_key: 사건⠂사고를 구분하는 유니크한 key
* descript: 사건⠂사고 유형(강도, 음주운전 등)
* address: 사건⠂사고 발생 주소
* location: 사건⠂사고 발생 위치(위도, 경도)
* timestamp: 사건⠂사고 발생일시. YYYY-MM-DD hh:mm:ss 형식

In [9]:
# 초기코드 - python

# 모듈 import
import pandas as pd

# 데이터 로드
df = pd.read_csv('./data/austine-incidents.csv', low_memory=False, index_col='unique_key')
df.head()

,descript,address,location,timestamp
unique_key,,,,
2016160158,POSS OF DRUG PARAPHERNALIA,7500 BLOCK N IH 35 SVRD SB,NaN,2016-01-16 01:09:00
20165001577,BURGLARY OF VEHICLE,1400 BLOCK BRIARCLIFF BLVD,NaN,2016-01-11 20:30:00
20165002896,IDENTITY THEFT-TAX RETURNS,200 BLOCK ELKHART ST,NaN,2016-01-21 14:00:00
20168000234,CRIMINAL MISCHIEF,3500 BLOCK NORTH HILLS DR,NaN,2016-01-16 20:10:00
20168000074,THEFT,4700 BLOCK STAGGERBRUSH RD,NaN,2015-12-18 20:05:00

In [ ]:
# 초기코드 - R

# 데이터 로드
df <- read.csv('./data/austine-incidents.csv', row.names='unique_key')
head(df)

# 과제

주어진 데이터를 활용해, 어떤 사건⠂사고가 발생한 후 다음 사건⠂사고가 발생하기까지 걸리는 시간을 알아보려 합니다.
  
## 할 일

##### 1. 다음 사건⠂사고가 발생하기까지 걸린 시간 측정하기

어떤 사건⠂사고가 발생한 시간과 이전 사건⠂사고가 발생한 시간의 차를 분단위로 `duration(m)` 컬럼에 저장해주세요. 첫 사건⠂사고는 이전 사건⠂사고가 없을 테니, 이 첫 사건⠂사고에 대한 row는 제외해주세요. 

정상적으로 코드를 작성했다면, row의 수는 9999개이며, 결과는 다음과 같이 나옵니다.

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>descript</th>
      <th>address</th>
      <th>location</th>
      <th>timestamp</th>
      <th>duration(m)</th>
    </tr>
    <tr>
      <th>unique_key</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2016530815</th>
      <td>THEFT</td>
      <td>700 BLOCK RIO GRANDE ST</td>
      <td>NaN</td>
      <td>2015-02-20 12:00:00</td>
      <td>2557.0</td>
    </tr>
    <tr>
      <th>20165013579</th>
      <td>OUT OF CITY OFFENSE</td>
      <td>12300 BLOCK ALAMEDA TRACE CIR</td>
      <td>NaN</td>
      <td>2015-02-23 12:00:00</td>
      <td>4320.0</td>
    </tr>
    <tr>
      <th>20165022918</th>
      <td>HARASSMENT</td>
      <td>500 BLOCK W 10TH ST</td>
      <td>NaN</td>
      <td>2015-02-24 11:09:00</td>
      <td>1389.0</td>
    </tr>
    <tr>
      <th>20168001525</th>
      <td>IDENTITY THEFT</td>
      <td>11400 BLOCK ROBERT WOODING DR</td>
      <td>NaN</td>
      <td>2015-02-24 15:55:00</td>
      <td>286.0</td>
    </tr>
    <tr>
      <th>20165008223</th>
      <td>LOST PROP</td>
      <td>3200 BLOCK FEATHERGRASS CT</td>
      <td>NaN</td>
      <td>2015-02-25 20:00:00</td>
      <td>1685.0</td>
    </tr>
  </tbody>
</table>

In [10]:
df.describe()

,descript,address,location,timestamp
count,10000,10000,670,10000
unique,284,5270,490,7238
top,THEFT,700 BLOCK E 8TH ST,"(30.26706768,-97.73934174)",2016-01-01 12:00:00
freq,805,73,10,36

In [12]:
df = df.sort_values(by='timestamp')
df.head()

,descript,address,location,timestamp
unique_key,,,,
20165007117,HARASSMENT,2400 BLOCK MAGIN MEADOW DR,NaN,2015-02-18 17:23:00
2016530815,THEFT,700 BLOCK RIO GRANDE ST,NaN,2015-02-20 12:00:00
20165013579,OUT OF CITY OFFENSE,12300 BLOCK ALAMEDA TRACE CIR,NaN,2015-02-23 12:00:00
20165022918,HARASSMENT,500 BLOCK W 10TH ST,NaN,2015-02-24 11:09:00
20168001525,IDENTITY THEFT,11400 BLOCK ROBERT WOODING DR,NaN,2015-02-24 15:55:00

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 20165007117 to 2016221262
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   descript   10000 non-null  object
 1   address    10000 non-null  object
 2   location   670 non-null    object
 3   timestamp  10000 non-null  object
dtypes: object(4)
memory usage: 390.6+ KB

In [14]:
df.timestamp = pd.to_datetime(df.timestamp)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 20165007117 to 2016221262
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   descript   10000 non-null  object
 1   address    10000 non-null  object
 2   location   670 non-null    object
 3   timestamp  10000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(3)
memory usage: 390.6+ KB

In [15]:
df.head()

,descript,address,location,timestamp
unique_key,,,,
20165007117,HARASSMENT,2400 BLOCK MAGIN MEADOW DR,NaN,2015-02-18 17:23:00
2016530815,THEFT,700 BLOCK RIO GRANDE ST,NaN,2015-02-20 12:00:00
20165013579,OUT OF CITY OFFENSE,12300 BLOCK ALAMEDA TRACE CIR,NaN,2015-02-23 12:00:00
20165022918,HARASSMENT,500 BLOCK W 10TH ST,NaN,2015-02-24 11:09:00
20168001525,IDENTITY THEFT,11400 BLOCK ROBERT WOODING DR,NaN,2015-02-24 15:55:00

In [18]:
l = list(df.timestamp)
l[0]

Timestamp('2015-02-18 17:23:00')

In [29]:
(l[1] - l[0]).total_seconds()/60

2557.0

In [32]:
l[len(l)-1]

Timestamp('2016-01-22 17:14:00')

In [34]:
p = []
for i in range(1, len(l)):
    p.append((l[i]-l[i-1]).total_seconds()/60)
len(p)

9999

In [36]:
df_2 = df.drop([df.index[0]])
df_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9999 entries, 2016530815 to 2016221262
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   descript   9999 non-null   object
 1   address    9999 non-null   object
 2   location   670 non-null    object
 3   timestamp  9999 non-null   datetime64[ns]
dtypes: datetime64[ns](1), object(3)
memory usage: 390.6+ KB

In [38]:
df_2.head()

,descript,address,location,timestamp
unique_key,,,,
2016530815,THEFT,700 BLOCK RIO GRANDE ST,NaN,2015-02-20 12:00:00
20165013579,OUT OF CITY OFFENSE,12300 BLOCK ALAMEDA TRACE CIR,NaN,2015-02-23 12:00:00
20165022918,HARASSMENT,500 BLOCK W 10TH ST,NaN,2015-02-24 11:09:00
20168001525,IDENTITY THEFT,11400 BLOCK ROBERT WOODING DR,NaN,2015-02-24 15:55:00
20165008223,LOST PROP,3200 BLOCK FEATHERGRASS CT,NaN,2015-02-25 20:00:00

In [39]:
# 여기에 코드를 작성하세요.
df_2['duration(m)'] = p

In [41]:
df_2.head()

,descript,address,location,timestamp,duration(m)
unique_key,,,,,
2016530815,THEFT,700 BLOCK RIO GRANDE ST,NaN,2015-02-20 12:00:00,2557.0
20165013579,OUT OF CITY OFFENSE,12300 BLOCK ALAMEDA TRACE CIR,NaN,2015-02-23 12:00:00,4320.0
20165022918,HARASSMENT,500 BLOCK W 10TH ST,NaN,2015-02-24 11:09:00,1389.0
20168001525,IDENTITY THEFT,11400 BLOCK ROBERT WOODING DR,NaN,2015-02-24 15:55:00,286.0
20165008223,LOST PROP,3200 BLOCK FEATHERGRASS CT,NaN,2015-02-25 20:00:00,1685.0

##### 2. 이상치 제거

`duration(m)`에는 값이 0이거나, 또는 너무 값이 큰 데이터가 들어있습니다. 이런 이상치와 outlier는 제거해야 합니다. 따라서 `duration(m)`의

* 값이 0 이하거나
* 정규분포에서 -2σ 이하 또는 2σ 이상인 값

을 가지는 데이터는 제거해주세요. 값을 정상적으로 제거했다면 남은 row는 7026개입니다.

In [ ]:
# 여기에 코드를 작성하세요.

In [43]:
df_2['duration(m)'].min()

0.0

In [47]:
df_2['std'] = (df_2['duration(m)'] - df_2['duration(m)'].mean())/df_2['duration(m)'].std()
df_2.head()

,descript,address,location,timestamp,duration(m),std
unique_key,,,,,,
2016530815,THEFT,700 BLOCK RIO GRANDE ST,NaN,2015-02-20 12:00:00,2557.0,8.665901
20165013579,OUT OF CITY OFFENSE,12300 BLOCK ALAMEDA TRACE CIR,NaN,2015-02-23 12:00:00,4320.0,14.756814
20165022918,HARASSMENT,500 BLOCK W 10TH ST,NaN,2015-02-24 11:09:00,1389.0,4.630628
20168001525,IDENTITY THEFT,11400 BLOCK ROBERT WOODING DR,NaN,2015-02-24 15:55:00,286.0,0.819921
20165008223,LOST PROP,3200 BLOCK FEATHERGRASS CT,NaN,2015-02-25 20:00:00,1685.0,5.653265

In [61]:
df_2['std'].max()

25.363224348133947

In [62]:
df_2['std'].min()

-0.16816850490046614

In [60]:
df_2['duration(m)'].std()

289.4475848826123

In [70]:
idx = df_2[(df_2['duration(m)'] <= 0) | (df_2['duration(m)'] <= df_2['duration(m)'].mean()-2*(df_2['duration(m)'].std())) | (df_2['duration(m)'] >= df_2['duration(m)'].mean()+2*(df_2['duration(m)'].std()))].index
df_3 = df_2.drop(idx)
df_3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7026 entries, 20168001525 to 2016221262
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   descript     7026 non-null   object
 1   address      7026 non-null   object
 2   location     512 non-null    object
 3   timestamp    7026 non-null   datetime64[ns]
 4   duration(m)  7026 non-null   float64
 5   std          7026 non-null   float64
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 384.2+ KB

In [71]:
df_4 = df_3.drop(['std'], axis=1)
df_4.head()

,descript,address,location,timestamp,duration(m)
unique_key,,,,,
20168001525,IDENTITY THEFT,11400 BLOCK ROBERT WOODING DR,NaN,2015-02-24 15:55:00,286.0
20165003526,THEFT,5900 BLOCK JOHNNY MORRIS RD,NaN,2015-03-01 05:00:00,300.0
20165017152,THEFT,3100 BLOCK E SH 71 EB,NaN,2015-03-01 10:00:00,300.0
20161120648,BURGLARY INFORMATION,12900 BLOCK HUNTERS CHASE DR,NaN,2015-03-01 10:47:00,47.0
20165032969,LOST PROP,700 BLOCK E 8TH ST,NaN,2015-03-01 12:00:00,73.0

##### 3. 결과 저장

채점을 하기 위해, 위에서 구한 `unique_key`, `duration(m)`을 현재 파일과 같은 디렉토리(.ipynb 파일이 있는 디렉토리)에 `incidents_duration.csv`이라는 이름으로 저장해주세요. 이때

1. `duration(m)`은 소숫점을 버리고, 정수 형식으로 저장
2. `unique_key` 순으로 정렬

해주셔야합니다. 저장할 파일 포맷은 data 디렉토리의 `incidents_duration(sample).csv` 파일을 참고하세요.

*주의* 

1. csv 파일의 컬럼은 반드시 unique_key - duration(m) 순이어야 합니다.
2. **csv 파일은 unique_key 순으로 정렬되어있어야 합니다.**

In [73]:
df_4.columns[0:4]

Index(['descript', 'address', 'location', 'timestamp'], dtype='object')

In [74]:
dt = df_4.drop(df_4.columns[0:4], axis=1)
dt.head()

             duration(m)
unique_key
20168001525        286.0
20165003526        300.0
20165017152        300.0
20161120648         47.0
20165032969         73.0

In [76]:
dt['duration(m)'] = dt['duration(m)'].astype('int')
dt.head()

             duration(m)
unique_key
20168001525          286
20165003526          300
20165017152          300
20161120648           47
20165032969           73

In [77]:
dt = dt.sort_values(by='unique_key')
dt.head()

            duration(m)
unique_key
20169125              6
201610045             1
201610077             2
201610079             2
201610099             6

In [78]:
# csv 파일 저장 예시 - python
df.to_csv('incidents_duration.csv')

In [ ]:
# csv 파일 저장 예시 - R
write.csv(df, file='incidents_duration.csv')